Revit 2026 API

# SteelElementPropertiesAddFabricationInformationForRevitElements Method

---
**Namespace:** Autodesk.Revit.DB.Steel**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> AddFabricationInformationForRevitElements(
	Document aDoc,
	IList<ElementId> elementIds
)
```
```vb
Public Shared Function AddFabricationInformationForRevitElements (
	aDoc As Document,
	elementIds As IList(Of ElementId)
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ AddFabricationInformationForRevitElements(
	Document^ aDoc,
	IList<ElementId^>^ elementIds
)
```
```fsharp
static member AddFabricationInformationForRevitElements :
        aDoc : Document *
        elementIds : IList<ElementId> -> IList<ElementId>
```

#### Parameters

aDoc Document

elementIds IListElementId

#### Return Value

IListElementId

#### Reference

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace